In [ ]:
import os
import pandas as pd

In [ ]:
def read_from_files(DIR_INPUT, BEGIN_DATE, END_DATE):

    files = [os.path.join(DIR_INPUT, f) for f in os.listdir(DIR_INPUT) if f>=BEGIN_DATE+'.pkl' and f<=END_DATE+'.pkl']

    frames = []
    for f in files:
        df = pd.read_pickle(f)
        frames.append(df)
        del df
    df_final = pd.concat(frames)

    df_final=df_final.sort_values('TRANSACTION_ID')
    df_final.reset_index(drop=True,inplace=True)
    #  Note: -1 are missing values for real world data
    df_final=df_final.replace([-1],0)

    return df_final

In [7]:
DIR_INPUT='./simulated-data-raw/'
BEGIN_DATE = "2018-04-01"
END_DATE = "2018-09-30"

read_from_files(DIR_INPUT, BEGIN_DATE, END_DATE)
%time transactions_df=read_from_files(DIR_INPUT, BEGIN_DATE, END_DATE)
print("{0} transactions loaded, containing {1} fraudulent transactions".format(len(transactions_df),transactions_df.TX_FRAUD.sum()))

CPU times: user 1.86 s, sys: 128 ms, total: 1.99 s
Wall time: 1.99 s
1754155 transactions loaded, containing 14763 fraudulent transactions

In [12]:
transactions_df.head()

,TRANSACTION_ID,TX_DATETIME,CUSTOMER_ID,TERMINAL_ID,TX_AMOUNT,TX_TIME_SECONDS,TX_TIME_DAYS,TX_FRAUD,TX_FRAUD_SCENARIO
0,0,2018-04-01 00:00:31,596,1997,57.16,31,0,0,0
1,1,2018-04-01 00:02:10,4961,4448,81.51,130,0,0,0
2,2,2018-04-01 00:07:56,2,1338,146.00,476,0,0,0
3,3,2018-04-01 00:09:29,4128,3730,64.49,569,0,0,0
4,4,2018-04-01 00:10:34,927,2705,50.99,634,0,0,0

,TRANSACTION_ID,TX_DATETIME,CUSTOMER_ID,TERMINAL_ID,TX_AMOUNT,TX_TIME_SECONDS,TX_TIME_DAYS,TX_FRAUD,TX_FRAUD_SCENARIO
0,0,2018-04-01 00:00:31,596,1997,57.16,31,0,0,0
1,1,2018-04-01 00:02:10,4961,4448,81.51,130,0,0,0
2,2,2018-04-01 00:07:56,2,1338,146.00,476,0,0,0
3,3,2018-04-01 00:09:29,4128,3730,64.49,569,0,0,0
4,4,2018-04-01 00:10:34,927,2705,50.99,634,0,0,0
...,...,...,...,...,...,...,...,...,...
1754150,1754150,2018-09-30 23:56:36,161,7152,54.24,15810996,182,0,0
1754151,1754151,2018-09-30 23:57:38,4342,5486,1.23,15811058,182,0,0
1754152,1754152,2018-09-30 23:58:21,618,3727,6.62,15811101,182,0,0
1754153,1754153,2018-09-30 23:59:52,4056,1039,55.40,15811192,182,0,0
1754154,1754154,2018-09-30 23:59:57,3542,7610,23.59,15811197,182,0,0